In [2]:
import numpy as np
import pandas as pd

pandas는 크게 두 가지 자료 구조로 이루어짐 
1. Series
2. DataFrame

Serise는 모든 데이터 유형(정수, 실수, 문자 등)을 담을 수 있다.   
Serise 생성해보기

s = pd.Series(data, index=index, name=name)

In [10]:
a = pd.Series([4,5,-6,7])
a

0    4
1    5
2   -6
3    7
dtype: int64

딕셔너리로 만들기

In [13]:
dict_data = {'a':4,'b':5,'c':-6,'d':7}
series_data = pd.Series(dict_data)
series_data

a    4
b    5
c   -6
d    7
dtype: int64

In [15]:
dict_data1 = {'a':8,'b':9,'c':10}
d_d = pd.Series(dict_data1)
d_d

a     8
b     9
c    10
dtype: int64

리스트로 만들기

In [16]:
list_data = ['2023-02-03',3.14,'ABC',100,True]
l_d = pd.Series(list_data)
l_d

0    2023-02-03
1          3.14
2           ABC
3           100
4          True
dtype: object

In [21]:
list_data2 = ['230','33','12','popo']
l_d2 = pd.Series(list_data2)
l_d2

0     230
1      33
2      12
3    popo
dtype: object

# DataFrame
* 배열로 생성하는 법

In [22]:
sample_array = np.arange(5)
sample_array

array([0, 1, 2, 3, 4])

In [23]:
sample_df = pd.DataFrame({
    'col1' : sample_array,
    'col2' : sample_array*2,
    'col3' : ["a","b","c","d","e"]
})
sample_df

   col1  col2 col3
0     0     0    a
1     1     2    b
2     2     4    c
3     3     6    d
4     4     8    e

In [24]:
sample_df = pd.DataFrame({
    'col1' : sample_array+5,
    'col2' : sample_array*2,
    'col3' : ["a","b","c","d","e"]
})
sample_df

   col1  col2 col3
0     5     0    a
1     6     2    b
2     7     4    c
3     8     6    d
4     9     8    e

리스트로 만들기

In [47]:
df = pd.DataFrame([[80,90,100,70],[70,80,90,100]],
                  index=['달리기','점프'],
                  columns=['모모','츄츄','디디','루루'])
df

     모모  츄츄   디디   루루
달리기  80  90  100   70
점프   70  80   90  100

딕셔너리로 생성하기

In [48]:
data = {'score1' : [91,94,97,100], 'score2' : [100, 97, 94, 91]}
data

{'score1': [91, 94, 97, 100], 'score2': [100, 97, 94, 91]}

In [49]:
data = pd.DataFrame(data, index=['a','b','c','d'])
data

   score1  score2
a      91     100
b      94      97
c      97      94
d     100      91

랜덤으로 생성하기

In [51]:
np.random.seed(0)

dates = pd.date_range('20230101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

df

                   A         B         C         D
2023-01-01  1.764052  0.400157  0.978738  2.240893
2023-01-02  1.867558 -0.977278  0.950088 -0.151357
2023-01-03 -0.103219  0.410599  0.144044  1.454274
2023-01-04  0.761038  0.121675  0.443863  0.333674
2023-01-05  1.494079 -0.205158  0.313068 -0.854096
2023-01-06 -2.552990  0.653619  0.864436 -0.742165

In [41]:
sample_df.drop("col5", axis=1)

   col1  col2  col3  col4
0     5     0     1     1
1     6     2     1     1
2     7     4     1     1
3     8     6     1     1
4     9     8     1     1

데이터 변환
* pd.DataFrame.to_parquet()
* pd.DataFrame.to_csv()
* pd.DataFrame.to_excel()

샘플 데이터 불러오기  
표를 만들기 귀찮다면 불러와도 괜찮을 것같다

In [10]:
import plotly.express as px

In [14]:
df = px.data.gapminder()
df.head()

,country,continent,year,lifeExp,pop,gdpPercap,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4

하지만 직접 표를 만들어보기로 해본다.

컬럼 추가, 삭제, 수정

컬럼 추가

In [50]:
frame_add_col = pd.DataFrame(columns=['col1','col2','col3','col4'])
frame_add_col['col4'] = ['1', '2']

frame_add_col

  col1 col2 col3 col4
0  NaN  NaN  NaN    1
1  NaN  NaN  NaN    2

In [27]:
s_a = np.arange(5)
s_a

array([0, 1, 2, 3, 4])

In [30]:
s_d = pd.DataFrame({
    'col1' : s_a+2,
    'col2' : s_a*2,
    'col3' : s_a+1
})
s_d

   col1  col2  col3
0     2     0     1
1     3     2     2
2     4     4     3
3     5     6     4
4     6     8     5

In [32]:
s_d['col1+col2'] = s_d['col1'] + s_d['col2']
s_d

   col1  col2  col3  col1+col2
0     2     0     1          2
1     3     2     2          5
2     4     4     3          8
3     5     6     4         11
4     6     8     5         14

In [36]:
s_d['결과'] = '불합격'
s_d.loc[s_d['col1+col2']>6, '결과'] = '합격'
s_d

   col1  col2  col3  col1+col2  col4   결과
0     2     0     1          2  col4  불합격
1     3     2     2          5  col4  불합격
2     4     4     3          8  col4   합격
3     5     6     4         11  col4   합격
4     6     8     5         14  col4   합격

Row 추가

In [40]:
s_d.loc['5'] = ['1','1','1','1','1']
s_d

  col1 col2 col3 col1+col2  col4
0    2    0    1         2  col4
1    3    2    2         5  col4
2    4    4    3         8  col4
3    5    6    4        11  col4
4    6    8    5        14  col4
5    1    1    1         1     1

컬럼 삭제

In [37]:
s_d.drop(columns=['결과'], inplace=True)
s_d

   col1  col2  col3  col1+col2  col4
0     2     0     1          2  col4
1     3     2     2          5  col4
2     4     4     3          8  col4
3     5     6     4         11  col4
4     6     8     5         14  col4

컬럼 수정

  col1 col2 col3 col1+col2  col4
0    2    0    1         2  col4
1    3    2    2         5  col4
2    4    4    3         8  col4
3    5    6    4        11  col4
4    6    8    5        14  col4
5    1    1    1         1     1

## 데이터 선택

In [45]:
import seaborn as sns

iris = sns.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [46]:
cond = iris['petal_length'].isin([1.4,1.3])
iris[cond][:5]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
6           4.6          3.4           1.4          0.3  setosa

* iloc  
행번호를 통해 행 데이터를 가져옵니다.

In [47]:
iris.iloc[2]

sepal_length       4.7
sepal_width        3.2
petal_length       1.3
petal_width        0.2
species         setosa
Name: 2, dtype: object